{"Header": "Ukraine: Boris Johnson warns Russian invasion would be disastrous", "URL": "https://www.bbc.com/news/uk-60113271", "Content": "Prime Minister Boris Johnson has warned Russia that invading Ukraine would be \"disastrous\" and a \"painful, violent and bloody business\".\nSpeaking as the Foreign Office pulled some embassy staff out of Ukraine, the PM said the situation was \"pretty gloomy\" but war was not inevitable.\nHe said the UK was \"leading on creating a package of economic sanctions\" against Russia and was supplying defensive weaponry to Ukraine.\nNato is putting forces on standby.\nIt says this is to reinforce its defences and for the purposes of deterrence and is also sending additional ships and fighter jets to member states in eastern Europe as a response to the continuing build up of Russian forces.\nRussia has denied plans for military action, but an estimated 100,000 troops have amassed on the border with the head of Nato warning of a risk of fresh conflict in Europe.\nThe Kremlin has accused Nato of escalating tensions with the move. Russia considers the alliance as a threat, and is demanding legal guarantees that it will not expand further east, including into Ukraine. But the US has said the issue at stake is Russian aggression, not Nato expansion.\nMr Johnson said: \"The intelligence is very clear that there are 60 Russian battle groups on the borders of Ukraine, the plan for a lightning war that could take out Kyiv is one that everybody can see.\n\"We need to make it very clear to the Kremlin, to Russia, that that would be a disastrous step.\"\nMr Johnson added that the UK stood \"four-square with the people of Ukraine\".\nDowning Street said there were no plans to send British combat troops to defend Ukraine.\nOfficials say there have been no specific threats to British diplomats but about half of the staff working in Kyiv will return to the UK. The US has ordered relatives of its embassy staff to leave, saying an invasion could come \"at any time\".\nThe embassy moves were described as precautionary, and nothing specific is thought to have occurred in the past 24 hours to have triggered the decisions of the US and UK.\nAbout 30 British diplomats - including the ambassador - remain in Ukraine.\nForeign Secretary Liz Truss said the British Embassy in Kyiv continued to operate but \"it's important that we prepare for any eventuality\".\nShe said the UK had a \"very strong package of sanctions ready to go\" and called for Germany's Nord Stream 2 gas pipeline to Russia to be cancelled in the event of an incursion into Ukraine, saying she was \"very, very concerned\" about Europe's energy dependence on Russia.\nAsked about the UK's accusations that Russian President Vladimir Putin was plotting to install a pro-Moscow figure to lead Ukraine's government, Ms Truss declined to elaborate on the source of the intelligence.\nBut she said: \"We are going to call out every instance of Russia trying to influence democracy, trying to subvert Ukraine, false flag operations and sabotage. We will call that out.\"\nEU staff in Ukraine will stay in place for now - EU foreign policy chief Josep Borrell said he would not \"dramatize\" the tensions.\nThe prime minister said he had visited Ukraine and knew the people of the country, adding: \"My judgment is that they will fight.\"\nMr Johnson, speaking to reporters in Milton Keynes, said: \"We also need to get a message that invading Ukraine, from a Russian perspective, is going to be a painful, violent and bloody business.\n\"I think it's very important that people in Russia understand that this could be a new Chechnya.\"\nThere was a major separatist conflict in Chechnya in the 1990s, with a decade of ultimately unsuccessful fighting for its independence.\nAsked if an invasion was imminent, Mr Johnson said: \"I've got to tell you that I think the intelligence is pretty gloomy at this point. There is certainly a very, very large array of Russian forces and we have to take the necessary steps.\n\"I don't think it's by any means inevitable now, I think that sense can still prevail.\"\nHe was due to speak to international allies on Monday.\nRussia has seized Ukrainian territory before, when it annexed Crimea in 2014, following fierce protests in Ukraine that toppled the country's pro-Russian president. Russian forces seized control of Crimea before the territory voted to join Russia in a referendum the West and Ukraine deemed illegal.\nRussian-backed rebels control areas of eastern Ukraine near Russia's borders in a conflict which has cost an estimated 14,000 lives. A 2015 peace deal is far from being fulfilled.\nOn Sunday, the UK Foreign Office accused Mr Putin of planning to install a pro-Moscow figure to lead Ukraine's government.\nThe man named by the UK Foreign Office - former Ukrainian MP Yevhen Murayev - called the claims \"stupid\" in an interview with Reuters news agency.\nThe Foreign Office has warned against all travel to Crimea and two areas of eastern Ukraine, Donetsk oblast and Luhansk oblast. It is advising against all but essential travel to the rest of Ukraine.\nAre you in Ukraine? Have you been affected by the rising tensions? Share your experiences by emailing haveyoursay@bbc.co.uk.\nPlease include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:\nI accept the Terms of Service\nIn some cases a selection of your comments and questions will be published, displaying your name and location as you provide it unless you state otherwise. Your contact details will never be published.\nAt no time should you endanger yourself or others, take any unnecessary risks or infringe any laws.\nThe BBC retains the right to select from these contributions based on editorial requirements and subject to online terms and conditions and BBC editorial guidelines. For more information about how the BBC handles your personal data, see here.\nIf you are reading this page and can't see the form you will need to visit the mobile version of the BBC website to submit your question or comment or you can email us at HaveYourSay@bbc.co.uk. Please include your name, age and location with any submission."}